CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_lpuart.h
/*!
    \file    gd32l23x_lpuart.h
    \brief   definitions for the LPUART

    \version 2021-08-04, V1.0.0, firmware for GD32L23x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32L23X_LPUART_H
#define GD32L23X_LPUART_H

#include "gd32l23x.h"

/* LPUART definitions */
#define LPUART                        LPUART_BASE

/* registers definitions */
#define LPUART_CTL0                   REG32(LPUART + 0x00000000U)         /*!< LPUART control register 0 */
#define LPUART_CTL1                   REG32(LPUART + 0x00000004U)         /*!< LPUART control register 1 */
#define LPUART_CTL2                   REG32(LPUART + 0x00000008U)         /*!< LPUART control register 2 */
#define LPUART_BAUD                   REG32(LPUART + 0x0000000CU)         /*!< LPUART baud rate register */
#define LPUART_CMD                    REG32(LPUART + 0x00000018U)         /*!< LPUART command register */
#define LPUART_STAT                   REG32(LPUART + 0x0000001CU)         /*!< LPUART status register */
#define LPUART_INTC                   REG32(LPUART + 0x00000020U)         /*!< LPUART status clear register */
#define LPUART_RDATA                  REG32(LPUART + 0x00000024U)         /*!< LPUART receive data register */
#define LPUART_TDATA                  REG32(LPUART + 0x00000028U)         /*!< LPUART transmit data register */
#define LPUART_CHC                    REG32(LPUART + 0x000000C0U)         /*!< LPUART coherence control register */

/* bits definitions */
/* LPUART CTL0 */
#define LPUART_CTL0_UEN               BIT(0)                              /*!< LPUART enable */
#define LPUART_CTL0_UESM              BIT(1)                              /*!< LPUART enable in deep-sleep mode */
#define LPUART_CTL0_REN               BIT(2)                              /*!< receiver enable */
#define LPUART_CTL0_TEN               BIT(3)                              /*!< transmitter enable */
#define LPUART_CTL0_IDLEIE            BIT(4)                              /*!< idle line detected interrupt enable */
#define LPUART_CTL0_RBNEIE            BIT(5)                              /*!< read data buffer not empty interrupt and overrun error interrupt enable */
#define LPUART_CTL0_TCIE              BIT(6)                              /*!< transmission complete interrupt enable */
#define LPUART_CTL0_TBEIE             BIT(7)                              /*!< transmitter register empty interrupt enable */
#define LPUART_CTL0_PERRIE            BIT(8)                              /*!< parity error interrupt enable */
#define LPUART_CTL0_PM                BIT(9)                              /*!< parity mode */
#define LPUART_CTL0_PCEN              BIT(10)                             /*!< parity control enable */
#define LPUART_CTL0_WM                BIT(11)                             /*!< wakeup method in mute mode */
#define LPUART_CTL0_WL0               BIT(12)                             /*!< word length low bit*/
#define LPUART_CTL0_MEN               BIT(13)                             /*!< mute mode enable */
#define LPUART_CTL0_AMIE              BIT(14)                             /*!< address match interrupt enable */
#define LPUART_CTL0_DED               BITS(16,20)                         /*!< driver enable deassertion time */
#define LPUART_CTL0_DEA               BITS(21,25)                         /*!< driver enable assertion time */
#define LPUART_CTL0_WL1               BIT(28)                             /*!< word length high bit*/

/* LPUART CTL1 */
#define LPUART_CTL1_ADDM              BIT(4)                              /*!< address detection mode */
#define LPUART_CTL1_STB               BITS(12,13)                         /*!< stop bits length */
#define LPUART_CTL1_STRP              BIT(15)                             /*!< swap TX/RX pins */
#define LPUART_CTL1_RINV              BIT(16)                             /*!< RX pin level inversion */
#define LPUART_CTL1_TINV              BIT(17)                             /*!< TX pin level inversion */
#define LPUART_CTL1_DINV              BIT(18)                             /*!< data bit level inversion */
#define LPUART_CTL1_MSBF              BIT(19)                             /*!< most significant bit first */
#define LPUART_CTL1_ADDR              BITS(24,31)                         /*!< address of the LPUART terminal */

/* LPUART CTL2 */
#define LPUART_CTL2_ERRIE             BIT(0)                              /*!< error interrupt enable in multibuffer communication */
#define LPUART_CTL2_HDEN              BIT(3)                              /*!< half-duplex enable */
#define LPUART_CTL2_DENR              BIT(6)                              /*!< DMA enable for reception */
#define LPUART_CTL2_DENT              BIT(7)                              /*!< DMA enable for transmission */
#define LPUART_CTL2_RTSEN             BIT(8)                              /*!< RTS enable */
#define LPUART_CTL2_CTSEN             BIT(9)                              /*!< CTS enable */
#define LPUART_CTL2_CTSIE             BIT(10)                             /*!< CTS interrupt enable */
#define LPUART_CTL2_OVRD              BIT(12)                             /*!< overrun disable */
#define LPUART_CTL2_DDRE              BIT(13)                             /*!< disable DMA on reception error */
#define LPUART_CTL2_DEM               BIT(14)                             /*!< driver enable mode */
#define LPUART_CTL2_DEP               BIT(15)                             /*!< driver enable polarity mode */
#define LPUART_CTL2_WUM               BITS(20,21)                         /*!< wakeup mode from deep-sleep mode */
#define LPUART_CTL2_WUIE              BIT(22)                             /*!< wakeup from deep-sleep mode interrupt enable */
#define LPUART_CTL2_UCESM             BIT(23)                             /*!< LPUART clock enable in Deep-sleep mode */

/* LPUART BAUD */
#define LPUART_BAUD_BRR               BITS(0,19)                          /*!< baud-rate divider */

/* LPUART CMD */
#define LPUART_CMD_MMCMD              BIT(2)                              /*!< mute mode command */
#define LPUART_CMD_RXFCMD             BIT(3)                              /*!< receive data flush command */

