CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_lpuart.h
/* LPUART STAT */
#define LPUART_STAT_PERR              BIT(0)                              /*!< parity error flag */
#define LPUART_STAT_FERR              BIT(1)                              /*!< frame error flag */
#define LPUART_STAT_NERR              BIT(2)                              /*!< noise error flag */
#define LPUART_STAT_ORERR             BIT(3)                              /*!< overrun error */
#define LPUART_STAT_IDLEF             BIT(4)                              /*!< idle line detected flag */
#define LPUART_STAT_RBNE              BIT(5)                              /*!< read data buffer not empty */
#define LPUART_STAT_TC                BIT(6)                              /*!< transmission completed */
#define LPUART_STAT_TBE               BIT(7)                              /*!< transmit data register empty */
#define LPUART_STAT_CTSF              BIT(9)                              /*!< CTS change flag */
#define LPUART_STAT_CTS               BIT(10)                             /*!< CTS level */
#define LPUART_STAT_BSY               BIT(16)                             /*!< busy flag */
#define LPUART_STAT_AMF               BIT(17)                             /*!< address match flag */
#define LPUART_STAT_RWU               BIT(19)                             /*!< receiver wakeup from mute mode */
#define LPUART_STAT_WUF               BIT(20)                             /*!< wakeup from deep-sleep mode flag */
#define LPUART_STAT_TEA               BIT(21)                             /*!< transmit enable acknowledge flag */
#define LPUART_STAT_REA               BIT(22)                             /*!< receive enable acknowledge flag */

/* LPUART INTC */
#define LPUART_INTC_PEC               BIT(0)                              /*!< parity error clear */
#define LPUART_INTC_FEC               BIT(1)                              /*!< frame error flag clear */
#define LPUART_INTC_NEC               BIT(2)                              /*!< noise detected clear */
#define LPUART_INTC_OREC              BIT(3)                              /*!< overrun error clear */
#define LPUART_INTC_IDLEC             BIT(4)                              /*!< idle line detected clear */
#define LPUART_INTC_TCC               BIT(6)                              /*!< transmission complete clear */
#define LPUART_INTC_CTSC              BIT(9)                              /*!< CTS change clear */
#define LPUART_INTC_AMC               BIT(17)                             /*!< address match clear */
#define LPUART_INTC_WUC               BIT(20)                             /*!< wakeup from deep-sleep mode clear */

/* LPUART RDATA */
#define LPUART_RDATA_RDATA            BITS(0,8)                           /*!< receive data value */

/* LPUART TDATA */
#define LPUART_TDATA_TDATA            BITS(0,8)                           /*!< transmit data value */

/* LPUART CHC */
#define LPUART_CHC_HCM                BIT(0)                              /*!< hardware flow control coherence mode */
#define LPUART_CHC_EPERR              BIT(8)                              /*!< early parity error flag */

/* constants definitions */
/* define the LPUART bit position and its register index offset */
#define LPUART_REGIDX_BIT(regidx, bitpos)   (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define LPUART_REG_VAL(lpuart, offset)      (REG32((lpuart) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define LPUART_BIT_POS(val)                 ((uint32_t)(val) & 0x0000001FU)
#define LPUART_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
        | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define LPUART_REG_VAL2(lpuart, offset)     (REG32((lpuart) + ((uint32_t)(offset) >> 22)))
#define LPUART_BIT_POS2(val)                (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define LPUART_CTL0_REG_OFFSET             ((uint32_t)0x00000000U)         /*!< CTL0 register offset */
#define LPUART_CTL1_REG_OFFSET             ((uint32_t)0x00000004U)         /*!< CTL1 register offset */
#define LPUART_CTL2_REG_OFFSET             ((uint32_t)0x00000008U)         /*!< CTL2 register offset */
#define LPUART_STAT_REG_OFFSET             ((uint32_t)0x0000001CU)         /*!< STAT register offset */
#define LPUART_CHC_REG_OFFSET              ((uint32_t)0x000000C0U)         /*!< CHC register offset */

/* LPUART flags */
typedef enum {
    /* flags in STAT register */
    LPUART_FLAG_REA = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 22U),      /*!< receive enable acknowledge flag */
    LPUART_FLAG_TEA = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 21U),      /*!< transmit enable acknowledge flag */
    LPUART_FLAG_WU = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 20U),       /*!< wakeup from Deep-sleep mode flag */
    LPUART_FLAG_RWU = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 19U),      /*!< receiver wakeup from mute mode */
    LPUART_FLAG_AM = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 17U),       /*!< ADDR match flag */
    LPUART_FLAG_BSY = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 16U),      /*!< busy flag */
    LPUART_FLAG_CTS = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 10U),      /*!< CTS level */
    LPUART_FLAG_CTSF = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 9U),      /*!< CTS change flag */
    LPUART_FLAG_TBE = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 7U),       /*!< transmit data buffer empty */
    LPUART_FLAG_TC = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 6U),        /*!< transmission complete */
    LPUART_FLAG_RBNE = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 5U),      /*!< read data buffer not empty */
    LPUART_FLAG_IDLE = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 4U),      /*!< IDLE line detected flag */
    LPUART_FLAG_ORERR = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 3U),     /*!< overrun error */
    LPUART_FLAG_NERR = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 2U),      /*!< noise error flag */
    LPUART_FLAG_FERR = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 1U),      /*!< frame error flag */
    LPUART_FLAG_PERR = LPUART_REGIDX_BIT(LPUART_STAT_REG_OFFSET, 0U),      /*!< parity error flag */
    /* flags in CHC register */
    LPUART_FLAG_EPERR = LPUART_REGIDX_BIT(LPUART_CHC_REG_OFFSET, 8U),      /*!< early parity error flag */
} lpuart_flag_enum;

