CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_lpuart.h
/* LPUART interrupt flags */
typedef enum {
    /* interrupt flags in CTL0 register */
    LPUART_INT_FLAG_AM = LPUART_REGIDX_BIT2(LPUART_CTL0_REG_OFFSET, 14U, LPUART_STAT_REG_OFFSET, 17U),       /*!< address match interrupt and flag */
    LPUART_INT_FLAG_PERR = LPUART_REGIDX_BIT2(LPUART_CTL0_REG_OFFSET, 8U, LPUART_STAT_REG_OFFSET, 0U),       /*!< parity error interrupt and flag */
    LPUART_INT_FLAG_TBE = LPUART_REGIDX_BIT2(LPUART_CTL0_REG_OFFSET, 7U, LPUART_STAT_REG_OFFSET, 7U),        /*!< transmitter buffer empty interrupt and flag */
    LPUART_INT_FLAG_TC = LPUART_REGIDX_BIT2(LPUART_CTL0_REG_OFFSET, 6U, LPUART_STAT_REG_OFFSET, 6U),         /*!< transmission complete interrupt and flag */
    LPUART_INT_FLAG_RBNE = LPUART_REGIDX_BIT2(LPUART_CTL0_REG_OFFSET, 5U, LPUART_STAT_REG_OFFSET, 5U),       /*!< read data buffer not empty interrupt and flag */
    LPUART_INT_FLAG_RBNE_ORERR = LPUART_REGIDX_BIT2(LPUART_CTL0_REG_OFFSET, 5U, LPUART_STAT_REG_OFFSET, 3U), /*!< read data buffer not empty interrupt and overrun error flag */
    LPUART_INT_FLAG_IDLE = LPUART_REGIDX_BIT2(LPUART_CTL0_REG_OFFSET, 4U, LPUART_STAT_REG_OFFSET, 4U),       /*!< IDLE line detected interrupt and flag */
    /* interrupt flags in CTL2 register */
    LPUART_INT_FLAG_WU = LPUART_REGIDX_BIT2(LPUART_CTL2_REG_OFFSET, 22U, LPUART_STAT_REG_OFFSET, 20U),       /*!< wakeup from deep-sleep mode interrupt and flag */
    LPUART_INT_FLAG_CTS = LPUART_REGIDX_BIT2(LPUART_CTL2_REG_OFFSET, 10U, LPUART_STAT_REG_OFFSET, 9U),       /*!< CTS interrupt and flag */
    LPUART_INT_FLAG_ERR_NERR = LPUART_REGIDX_BIT2(LPUART_CTL2_REG_OFFSET, 0U, LPUART_STAT_REG_OFFSET, 2U),   /*!< error interrupt and noise error flag */
    LPUART_INT_FLAG_ERR_ORERR = LPUART_REGIDX_BIT2(LPUART_CTL2_REG_OFFSET, 0U, LPUART_STAT_REG_OFFSET, 3U),  /*!< error interrupt and overrun error flag */
    LPUART_INT_FLAG_ERR_FERR = LPUART_REGIDX_BIT2(LPUART_CTL2_REG_OFFSET, 0U, LPUART_STAT_REG_OFFSET, 1U),   /*!< error interrupt and frame error flag */
} lpuart_interrupt_flag_enum;

/* LPUART interrupt enable or disable */
typedef enum {
    /* interrupt in CTL0 register */
    LPUART_INT_AM = LPUART_REGIDX_BIT(LPUART_CTL0_REG_OFFSET, 14U),         /*!< address match interrupt */
    LPUART_INT_PERR = LPUART_REGIDX_BIT(LPUART_CTL0_REG_OFFSET, 8U),        /*!< parity error interrupt */
    LPUART_INT_TBE = LPUART_REGIDX_BIT(LPUART_CTL0_REG_OFFSET, 7U),         /*!< transmitter buffer empty interrupt */
    LPUART_INT_TC = LPUART_REGIDX_BIT(LPUART_CTL0_REG_OFFSET, 6U),          /*!< transmission complete interrupt */
    LPUART_INT_RBNE = LPUART_REGIDX_BIT(LPUART_CTL0_REG_OFFSET, 5U),        /*!< read data buffer not empty interrupt and overrun error interrupt */
    LPUART_INT_IDLE = LPUART_REGIDX_BIT(LPUART_CTL0_REG_OFFSET, 4U),        /*!< IDLE line detected interrupt */
    /* interrupt in CTL2 register */
    LPUART_INT_WU = LPUART_REGIDX_BIT(LPUART_CTL2_REG_OFFSET, 22U),         /*!< wakeup from deep-sleep mode interrupt */
    LPUART_INT_CTS = LPUART_REGIDX_BIT(LPUART_CTL2_REG_OFFSET, 10U),        /*!< CTS interrupt */
    LPUART_INT_ERR = LPUART_REGIDX_BIT(LPUART_CTL2_REG_OFFSET, 0U),         /*!< error interrupt */
} lpuart_interrupt_enum;

/* LPUART invert configure */
typedef enum {
    /* data bit level inversion */
    LPUART_DINV_ENABLE = 0,                                          /*!< data bit level inversion */
    LPUART_DINV_DISABLE,                                             /*!< data bit level not inversion */
    /* TX pin level inversion */
    LPUART_TXPIN_ENABLE,                                             /*!< TX pin level inversion */
    LPUART_TXPIN_DISABLE,                                            /*!< TX pin level not inversion */
    /* RX pin level inversion */
    LPUART_RXPIN_ENABLE,                                             /*!< RX pin level inversion */
    LPUART_RXPIN_DISABLE,                                            /*!< RX pin level not inversion */
    /* swap TX/RX pins */
    LPUART_SWAP_ENABLE,                                              /*!< swap TX/RX pins */
    LPUART_SWAP_DISABLE,                                             /*!< not swap TX/RX pins */
} lpuart_invert_enum;

/* LPUART receiver configure */
#define CTL0_REN(regval)              (BIT(2) & ((uint32_t)(regval) << 2))
#define LPUART_RECEIVE_ENABLE         CTL0_REN(1)                    /*!< enable receiver */
#define LPUART_RECEIVE_DISABLE        CTL0_REN(0)                    /*!< disable receiver */

/* LPUART transmitter configure */
#define CTL0_TEN(regval)              (BIT(3) & ((uint32_t)(regval) << 3))
#define LPUART_TRANSMIT_ENABLE        CTL0_TEN(1)                    /*!< enable transmitter */
#define LPUART_TRANSMIT_DISABLE       CTL0_TEN(0)                    /*!< disable transmitter */

/* LPUART parity bits definitions */
#define CTL0_PM(regval)               (BITS(9,10) & ((uint32_t)(regval) << 9))
#define LPUART_PM_NONE                CTL0_PM(0)                     /*!< no parity */
#define LPUART_PM_EVEN                CTL0_PM(2)                     /*!< even parity */
#define LPUART_PM_ODD                 CTL0_PM(3)                     /*!< odd parity */

/* LPUART wakeup method in mute mode */
#define CTL0_WM(regval)               (BIT(11) & ((uint32_t)(regval) << 11))
#define LPUART_WM_IDLE                CTL0_WM(0)                     /*!< idle line */
#define LPUART_WM_ADDR                CTL0_WM(1)                     /*!< address match */

/* LPUART word length definitions */
#define CTL0_WL01(regval1, regval2)   ((BIT(12) & ((uint32_t)(regval1) << 12))|(BIT(28) & ((uint32_t)(regval2) << 28)))
#define LPUART_WL_7BIT                CTL0_WL01(0,1)                 /*!< 7 bits */
#define LPUART_WL_8BIT                CTL0_WL01(0,0)                 /*!< 8 bits */
#define LPUART_WL_9BIT                CTL0_WL01(1,0)                 /*!< 9 bits */

/* LPUART address detection mode */
#define CTL1_ADDM(regval)             (BIT(4) & ((uint32_t)(regval) << 4))
#define LPUART_ADDM_4BIT              CTL1_ADDM(0)                   /*!< 4-bit address detection */
#define LPUART_ADDM_FULLBIT           CTL1_ADDM(1)                   /*!< full-bit address detection */

/* LPUART stop bits definitions */
#define CTL1_STB(regval)              (BITS(12,13) & ((uint32_t)(regval) << 12))
#define LPUART_STB_1BIT               CTL1_STB(0)                    /*!< 1 bit */
#define LPUART_STB_2BIT               CTL1_STB(2)                    /*!< 2 bits */

