CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_lpuart.h
/* LPUART data is transmitted/received with the LSB/MSB first */
#define CTL1_MSBF(regval)             (BIT(19) & ((uint32_t)(regval) << 19))
#define LPUART_MSBF_LSB               CTL1_MSBF(0)                   /*!< LSB first */
#define LPUART_MSBF_MSB               CTL1_MSBF(1)                   /*!< MSB first */

/* DMA enable for reception */
#define CTL2_DENR(regval)             (BIT(6) & ((uint32_t)(regval) << 6))
#define LPUART_DENR_ENABLE            CTL2_DENR(1)                   /*!< enable for reception */
#define LPUART_DENR_DISABLE           CTL2_DENR(0)                   /*!< disable for reception */

/* DMA enable for transmission */
#define CTL2_DENT(regval)             (BIT(7) & ((uint32_t)(regval) << 7))
#define LPUART_DENT_ENABLE            CTL2_DENT(1)                   /*!< enable for transmission */
#define LPUART_DENT_DISABLE           CTL2_DENT(0)                   /*!< disable for transmission */

/* LPUART RTS hardware flow control configure */
#define CTL2_RTSEN(regval)            (BIT(8) & ((uint32_t)(regval) << 8))
#define LPUART_RTS_ENABLE             CTL2_RTSEN(1)                  /*!< RTS hardware flow control enabled */
#define LPUART_RTS_DISABLE            CTL2_RTSEN(0)                  /*!< RTS hardware flow control disabled */

/* LPUART CTS hardware flow control configure */
#define CTL2_CTSEN(regval)            (BIT(9) & ((uint32_t)(regval) << 9))
#define LPUART_CTS_ENABLE             CTL2_CTSEN(1)                  /*!< CTS hardware flow control enabled */
#define LPUART_CTS_DISABLE            CTL2_CTSEN(0)                  /*!< CTS hardware flow control disabled */

/* LPUART driver enable polarity mode */
#define CTL2_DEP(regval)              (BIT(15) & ((uint32_t)(regval) << 15))
#define LPUART_DEP_HIGH               CTL2_DEP(0)                    /*!< DE signal is active high */
#define LPUART_DEP_LOW                CTL2_DEP(1)                    /*!< DE signal is active low */

/* LPUART wakeup mode from deep-sleep mode */
#define CTL2_WUM(regval)              (BITS(20,21) & ((uint32_t)(regval) << 20))
#define LPUART_WUM_ADDR               CTL2_WUM(0)                    /*!< WUF active on address match */
#define LPUART_WUM_STARTB             CTL2_WUM(2)                    /*!< WUF active on start bit */
#define LPUART_WUM_RBNE               CTL2_WUM(3)                    /*!< WUF active on RBNE */

/* LPUART hardware flow control coherence mode */
#define CHC_HCM(regval)               (BIT(0) & ((uint32_t)(regval) << 0))
#define LPUART_HCM_NONE               CHC_HCM(0)                     /*!< nRTS signal equals to the rxne status register */
#define LPUART_HCM_EN                 CHC_HCM(1)                     /*!< nRTS signal is set when the last data bit has been sampled */

/* function declarations */
/* initialization functions */
/* reset LPUART */
void lpuart_deinit(void);
/* configure LPUART baud rate value */
void lpuart_baudrate_set(uint32_t baudval);
/* configure LPUART parity */
void lpuart_parity_config(uint32_t paritycfg);
/* configure LPUART word length */
void lpuart_word_length_set(uint32_t wlen);
/* configure LPUART stop bit length */
void lpuart_stop_bit_set(uint32_t stblen);
/* enable LPUART */
void lpuart_enable(void);
/* disable LPUART */
void lpuart_disable(void);
/* configure LPUART transmitter */
void lpuart_transmit_config(uint32_t txconfig);
/* configure LPUART receiver */
void lpuart_receive_config(uint32_t rxconfig);

/* LPUART normal mode communication */
/* data is transmitted/received with the LSB/MSB first */
void lpuart_data_first_config(uint32_t msbf);
/* configure LPUART inverted */
void lpuart_invert_config(lpuart_invert_enum invertpara);
/* enable the LPUART overrun function */
void lpuart_overrun_enable(void);
/* disable the LPUART overrun function */
void lpuart_overrun_disable(void);
/* LPUART transmit data function */
void lpuart_data_transmit(uint32_t data);
/* LPUART receive data function */
uint16_t lpuart_data_receive(void);
/* enable LPUART command */
void lpuart_command_enable(uint32_t cmdtype);

/* multi-processor communication */
/* configure address of the LPUART */
void lpuart_address_config(uint8_t addr);
/* configure address detection mode */
void lpuart_address_detection_mode_config(uint32_t addmod);
/* enable mute mode */
void lpuart_mute_mode_enable(void);
/* disable mute mode */
void lpuart_mute_mode_disable(void);
/* configure wakeup method in mute mode */
void lpuart_mute_mode_wakeup_config(uint32_t wmethod);

/* half-duplex communication */
/* enable half-duplex mode */
void lpuart_halfduplex_enable(void);
/* disable half-duplex mode */
void lpuart_halfduplex_disable(void);

/* hardware flow communication */
/* configure hardware flow control RTS */
void lpuart_hardware_flow_rts_config(uint32_t rtsconfig);
/* configure hardware flow control CTS */
void lpuart_hardware_flow_cts_config(uint32_t ctsconfig);

/* coherence control */
/* configure hardware flow control coherence mode */
void lpuart_hardware_flow_coherence_config(uint32_t hcm);

/* enable RS485 driver */
void lpuart_rs485_driver_enable(void);
/* disable RS485 driver */
void lpuart_rs485_driver_disable(void);
/* configure driver enable assertion time */
void lpuart_driver_assertime_config(uint32_t deatime);
/* configure driver enable de-assertion time */
void lpuart_driver_deassertime_config(uint32_t dedtime);
/* configure driver enable polarity mode */
void lpuart_depolarity_config(uint32_t dep);

/* LPUART DMA */
/* configure LPUART DMA for reception */
void lpuart_dma_receive_config(uint32_t dmacmd);
/* configure LPUART DMA for transmission */
void lpuart_dma_transmit_config(uint32_t dmacmd);
/* disable DMA on reception error */
void lpuart_reception_error_dma_disable(void);
/* enable DMA on reception error */
void lpuart_reception_error_dma_enable(void);

/* enable LPUART to wakeup the mcu from deep-sleep mode */
void lpuart_wakeup_enable(void);
/* disable LPUART to wakeup the mcu from deep-sleep mode */
void lpuart_wakeup_disable(void);
/* configure the LPUART wakeup mode from deep-sleep mode */
void lpuart_wakeup_mode_config(uint32_t wum);

/* flag & interrupt functions */
/* get flag in STAT/CHC register */
FlagStatus lpuart_flag_get(lpuart_flag_enum flag);
/* clear LPUART status */
void lpuart_flag_clear(lpuart_flag_enum flag);
/* enable LPUART interrupt */
void lpuart_interrupt_enable(lpuart_interrupt_enum interrupt);
/* disable LPUART interrupt */
void lpuart_interrupt_disable(lpuart_interrupt_enum interrupt);
/* get LPUART interrupt and flag status */
FlagStatus lpuart_interrupt_flag_get(lpuart_interrupt_flag_enum int_flag);
/* clear LPUART interrupt flag */
void lpuart_interrupt_flag_clear(lpuart_interrupt_flag_enum int_flag);

#endif /* GD32L23X_LPUART_H */
